[
	{
		"curName": "T-Mobile Park",
		"firstYear": 1999,
		"prevNames": ["Safeco Field"],
		"springTraining": false,
		"review": [
			{ "text": "Intro", "type": "SectionHeader"},
			{ "text": "T-Mobile Park is the home park of my Seattle Mariners. I grew up going to games here, and have gone to almost 60 games over the past ten seasons. This has been home to many memorable experiences, including historic games and other exciting moments. While I won't be going over every game I've attended, as I already have the game notes for that, I'll expand upon certain aspects of the park that I haven't dug into yet.", "type": "Paragraph"},
			{ "text": "Exterior", "type": "SectionHeader"},
			{ "text": "There are four main gates; left field, center field, right field, and home plate. There is also the third base entry, but that is currently only available for T-Mobile customers, a change made when T-Mobile purchased the naming rights to the stadium after Safeco Insurance decided to not renew the naming rights contract. It had previously been known as Safeco Field. While the home plate gate has the fancy bat sculpture chandelier, I always enter the center field gate. The stairway is enormous, and it's right across the street from my regular parking spot, the Lumen Field Event Center Parking Garage.", "type": "Paragraph"},
			{ "text": "Concourses", "type": "SectionHeader"},
			{ "text": "Once you enter from this gate and ascend the stairway, you are on the concourse, and have a great view of the field. Somewhat nearby to the left is the Dave Niehaus statue, honoring the Mariners Hall of Fame broadcaster. He was often the sole reason to tune into games in the early days of the franchise. To the right is the concourse above the bullpen, colloquially known as the 'Pen. The bleachers are beyond the left and center field walls, and have some nice padded backrests. While the center field bleachers are directly in front of the scoreboard, the left field ones still provide a decent view. However, you're missing out on the out-of-town scoreboard sitting up there. The center field scoreboard was the biggest scoreboard in baseball upon its installation before the 2013 season, but that has been surpassed many times over by now. Regardless of your seat, you'll still get a great view of the playing field.", "type": "Paragraph"},
			{ "text": "The concourse in foul territory is triple-decked, as most modern stadiums are. The main concourse is usually very busy, especially with the concessions stands separate from the main ones. The 3rd level is less busy, and is easier to navigate around. The 2nd level is definitely the nicest of the 3, as the seats have padded backrests, and the concourse is indoors. I've sat in all 3 a significant amount. While the 2nd level has nicer amenities, my favorite view and environment is on the 3rd base side. You get some great views, a perfect blend of both the field and city.", "type": "Paragraph"},
			{ "text": "The first level has the most attractions. Aside from the locations mentioned previously, there is the Mariners Team Store. While it also serves as an entry into the park, it's only worth using it as such if you were already in the store. There's a large number of jerseys for sale, along with a large wall of baseball hats with many recolorings of the standard Mariners logo. There are a wide variety of food options as well. There is your typical ballpark food, including hot dogs, garlic fries, beer, and more. However, there are also more unconventional choices, such as Din Tai Fung, among others. I generally just get the classic hot dog, while occasionally going for chicken tenders and fries. T-Mobile Park has Pepsi products, which is a disappointment to some (myself included). There is also the kids area, which I think is known as the Moose Den, in center field. There is a neat fountain nearby, which has 3 streams of water shooting upward, and a batter statue positioned to hit them. The main level also contains the Mariners Hall of Fame, which includes the best players from the teams history, along with history of baseball in the pacific northwest. It's a neat little area and I'd recommend everyone visit it.", "type": "Paragraph"},
			{ "text": "On the 3rd level, there are some great views of the city. A good one is just above the home plate gate on the concourse, as you can get some good picturesque views of Seattle. However, there's a place at the very end of the 3rd deck on the left field side called the Trident Deck, previously known as the Lookout Landing. Here you probably get the best view of the city, and a solid view of the field. I've never sat here before, but I did go out of my way to get a picture on Opening Day 2021. Something interesting about the 3rd deck is that the seats above right field are rarely occupied by anyone. I'm assuming the Mariners prevent people from buying tickets over there unless absolutely necessary, so they can have those concession stands closed. Consequently, if that section is full you can bet the rest of the stadium is too. ", "type": "Paragraph"},
			{ "text": "Now for the 2nd level. I've sat here a number of times, and it's a great place to sit. It has a nicer feel compared to the rest of the park, since the sections are indoors. The seats are padded, giving a higher-class feel. The walkways are much smaller than the main concourses on the first and third decks, and as a result have fewer concession vendors. However, I've never really felt like I've missed out on what I wanted to get. As I've said, the first deck still has the most options by far. The press box is also on this level, and one time I'm pretty sure I saw Mariners general manager Jerry Dipoto walk out of there. ", "type": "Paragraph"},
			{ "text": "Field", "type": "SectionHeader"},
			{ "text": "The field dimensions of T-Mobile Park have been largely the same. The fences were pulled in before the 2013 season, but only by a little bit. It reduced the distances everywhere except for the right field foul line. There is an odd divot in the right field corner, where the fence is at an angle not directed to the foul pole, resulting in an odd imperfection in the field shape. While imperfections are usually a neat quirk, I kinda hope the Mariners just fill that area in with a few more seats and make it a nicer looking corner. A minor detail for sure, but it'd be a neat change. The backstop was padded for a long time, but upon the name change, the Mariners decided to change it to a brick backstop, which looks really nice in my opinion. It also results in balls bouncing back much more quickly than before. I do wish they had extended the brick wall down to the foul lines, to maintain consistency, but it doesn't look weird at all the way it is now.", "type": "Paragraph"},
			{ "text": "Game Experience", "type": "SectionHeader"},
			{ "text": "The game experience is pretty great. The scoreboard always has fun attractions. The most notable includes the hydro boat race, where 3 animated boats race on Lake Washington. The winner means absolutely nothing, but it's funny seeing people getting so passionate about a meaningless boat race during a commercial break (full disclosure, I get into it as well). There is also the hat trick, where a baseball is placed under a hat, the hats are shuffled, and then everyone guesses where the ball is. I've seen these in other stadiums, so this one seems rather common. There's also a \"guess the song\" challenge done by the local classic rock radio station, along with some baseball trivia based on the year the song was from. The Mariners play \"Louie Louie\" in the 7th inning stretch after Take Me Out to the Ballgame. The scoreboard will also encourage fans to get loud at certain times, which isn't terrible, but I prefer the more natural excitement from fans just paying attention to the situation. It feels more genuine that way. One thing I dislike about T-Mobile Park's scoreboard and audio is that the organ sounds really fake, and honestly it probably is. Fortunately, it's not relied on too heavily, as the sound person does a great job of playing songs that get you excited for the game. Speaking of songs, the Mariners will play a song from their TV intro from the 90s; it's also currently played on the radio. It's a fantastic song, and has no right to be as good as it is.", "type": "Paragraph"},
			{ "text": "Conclusion", "type": "SectionHeader"},
			{ "text": "While the Mariners have generally been considered \"not good\" over the past decade, they've had at least some success. They had 4 winning seasons where they came relatively close to a playoff spot, and every year in between those they had a competitive team. The only full seasons I'd definitely say were non-competitive are 2012, 2013, and 2019. All together, I've seen 20 Mariners wins and 16 losses.", "type": "Paragraph"}
		]
	},
	{
		"curName": "Wrigley Field",
		"firstYear": 1914,
		"prevNames": [],
		"springTraining": false,
		"review": [
			{ "text": "Intro", "type": "SectionHeader"},
			{ "text": "This was my second ever park, and it was a pretty great second park to go to. However, I am writing this review almost 9 years after the game, so I won't have as many details, compared to more recent reviews. But nonetheless, I hope this review will be an interesting read.", "type": "Paragraph"},
			{ "text": "Exterior", "type": "SectionHeader"},
			{ "text": "I believe there were 4 gates when I went to the game; one at home plate, one each of the left and right field corners, and one in center field into the bleachers. The bleachers were completely redone the offseason after I visited, and I didn't sit out there, so I do not remember what it was like. Since I was there in 2014, there was a large banner on the front of the home plate entrance, that had the years 1914 and 2014, along with an \"IT'S THE PARTY OF THE CENTURY\" banner. There is also the famous Wrigley Field marquee, that has been there for decades.", "type": "Paragraph"},
			{ "text": "Concourses", "type": "SectionHeader"},
			{ "text": "Entering the park, you immediately felt taken back in time. The concourses were understandably much smaller than T-Mobile Park, as that was the only stadium I had been to before at that point, but even looking back, it was smaller relative to most parks you'd find today. Also different from most other parks, the concourse is below the main deck, and so you have to take tunnels up to the main concourse. In Seattle, all the rows are in front of the concourse, and you walk down to your seat no matter where you are on the first level. So that was a big change here. There were also different naming schemes here. I have a photo of the sign above one of the tunnels, that says \"Field Box Aisles 106-109\" and \"Terrace Box Aisles 205-208\". If I remember correctly, we sat in a field box seat. I also remember that the concourse was extremely flat, in that if someone stood up several rows in front of you, it would block your view, whereas in Seattle, the slope was steep enough that someone ten rows in front of you wouldn't matter at all.", "type": "Paragraph"},
			{ "text": "Wrigley Field does have an upper deck, though it's understandably entirely in foul territory. The only jewel box era parks that lasted a long time and had an upper deck beyond the outfield were Tiger Stadium and Comiskey Park. I don't think I was able to get up to the upper deck, either because I wasn't interested or I simply wasn't allowed to by the staff. I know that going to the bleachers actually required you to go out of the park, which was <i>very</i> interesting. To date, it's the only park I've been to that has a completely disconnected outfield seats, and will probably be the only one ever like that. I think this was also changed in recent years as they've made several improvements to the park.", "type": "Paragraph"},
			{ "text": "Field", "type": "SectionHeader"},
			{ "text": "The dimensions at Wrigley had some changes early in it's history, but have largely remained the same for several decades. It's actually harder to hit the ball out down the lines than it is into the power alleys, as there are these little divots in the wall that angle back slightly. The distance to the lines are 353 and 355 feet for the left and right field poles respectively, which I believe are the longest distances to the poles in baseball. In 2014 the bullpens resided in the absolutely tiny amount of foul territory that exists, before the Cubs moved the bullpens below the bleachers for the 2017 season, reducing the foul ground even more. There is also the famous ivy, which was in full bloom. In the early months of the season, there are no leaves on the ivy yet, and they are usually fully grown by around June.", "type": "Paragraph"},
			{ "text": "Game Experience", "type": "SectionHeader"},
			{ "text": "The game experience was pretty great! Wrigley has the organ, which the Mariners don't have 99% of the time. The only time I remember them having an organ in Seattle was in a Turn Back the Clock game in 2013 (also against the Cubs as it happens), when they were throwing it back to 1906, and it was an extremely fake-sounding organ to be honest. But you could tell this organ in Wrigley was the real deal. It was playing various tunes before the game as background music. It was actually a little cloudy before the game started, to the point where the tarp was out. When it was wrapped up, the crowd that had gathered to that point applauded. Another note about Wrigley at this time, is that it had <i>no jumbotron to speak of.</i>They couldn't even show a replay review to the fans when there was a challenge during the game, because there was nothing to show it on! It was really quite a throwback in that sense. Like the rebuilt bleachers, I missed the jumbotron additions by a year, as they were added for the 2015 season. However, it really didn't detract from the experience at all. They also had someone sing along to \"Take Me Out to the Ballgame\" in the 7th inning stretch, which is something that Harry Caray would do long ago. There is also a manual out of town scoreboard out beyond center field, which is in the banner picture. I will swap out that banner picture if I can find a picture of the field itself, but I didn't have a great smartphone camera at the time, so I didn't take too many photos.", "type": "Paragraph"},
			{ "text": "Conclusion", "type": "SectionHeader"},
			{ "text": "In general, Wrigley Field is an excellent experience and a must-visit for baseball fans. While I would love to return to all ballparks I've been to, Wrigley Field is near the top of the list, partly because I enjoyed it so much originally, partially because I really enjoyed Chicago, but also because there are just so many changes since I last went. When I went to Fenway Park in 2019, they had already done basically all of the big renovations to that point. But with Wrigley, I was going the year before a lot of them started. So I hope to return there soon, perhaps even in the next few years.", "type": "Paragraph"}
		]
	},
	{
		"curName": "Guaranteed Rate Field",
		"firstYear": 1991,
		"prevNames": ["U.S. Cellular Field"],
		"springTraining": false,
		"review": [
			{ "text": "Intro", "type": "SectionHeader"},
			{ "text": "Guaranteed Rate Field, then named U.S. Cellular Field, is the home park of the Chicago White Sox and has been since 1991. It replaced the south side equivalent of Wrigley Field, which sadly was not preserved like it's north side counterpart. It also opened in a really unfortunate time, as it was literally just one season before Oriole Park at Camden Yards opened, and started the retro ballpark trend around Major League Baseball. That being said, the White Sox have made some improvements to Guaranteed Rate Field to try and make it feel old-style, some of which are better than others.", "type": "Paragraph"},
			{ "text": "Also, apologies for the terrible photo quality in the header. The picture was taken with an iPhone 4 back in 2014, and all future images are of much higher quality.", "type": "Paragraph"},
			{ "text": "Exterior", "type": "SectionHeader"},
			{ "text": "The exterior of the park had \"U.S. Cellular Field\" engraved to some sort of stone or concrete at one of the gates, and likely several others. Based on a couple Google street view images, it appears they have since been replaced with \"HOME OF THE CHICAGO WHITE SOX\", which I think looks better, though it's odd that Guaranteed Rate wouldn't want to plaster their brand for everyone to see. When the name change was first announced, a lot of people online said that it was the new worst ballpark name in the majors, and I think I would agree with them. Other recent changes for the worse include Miller Park to American Family Field, and Marlins Park to loanDepot Park, though Guaranteed Rate Field probably rolls off the tongue the worst. There is a building that links up to the first base side of the ballpark, that I think follows the shape of the original Comiskey Park. There is also a painted spot in the parking lot nearby that represents the home plate of the original Comiskey Park, though I didn't visit it for some reason when I went back in 2014.", "type": "Paragraph"},
			{ "text": "Concourses", "type": "SectionHeader"},
			{ "text": "The concourses here reminded me much more of T-Mobile Park rather than Wrigley Field, as all the rows are below the concourse, and you walk down to your seat no matter where you are on the 100 level. I also wanted to go up to the upper deck to take a top down photo, and it was called the 500 deck for some reason; T-Mobile Park's counterpart is the 300 level. It appears there are two levels of suites, and another level of some terrace level of some sort. If I go back, I may have to sit in those terrace seats, as I really like the view and experience you get there. In most cases, it's the perfect balance of view and closeness to the field. Regarding the 500 level, the White Sox actually removed several of the back rows in the early 2000s, to try and give the park a more intimate feel. This was a good move, as those seats are already quite high up.", "type": "Paragraph"},
			{ "text": "Unlike Wrigley but like T-Mobile Park, you can do a complete loop around the 100 level, which I remember doing at some point during the game. There is no upper deck beyond the outfield walls, unlike the original Comiskey Park, but I think it works quite well. There is some \"steel framework\" that surrounds the edge of the concourse, which holds many scoreboards and video boards the park possesses. Looking at old photos, this framework was painted white on the park's opening, and the outfield walls were painted blue! Now, the framework is painted dark grey, and the outfield walls were redone to feature historic White Sox players on a black background. It's amazing how much of a difference this color swap makes. The framework is neat, and while it could seem like it cuts off the park from the outside, it's not a solid wall, so it's open enough that you don't feel confined, but it still clearly defines where the park ends.", "type": "Paragraph"},
			{ "text": "Field", "type": "SectionHeader"},
			{ "text": "As mentioned before, the outfield walls were repainted at one point. The bullpens were never on the field, but were moved once during the parks history. The outfield walls were also brought in before the 2004 season, but the field is mostly symmetrical, and while the dimensions are different, the old Comiskey Park also had symmetrical dimensions. In general though, the field is mostly uninteresting, and pretty standard.", "type": "Paragraph"},
			{ "text": "Game Experience", "type": "SectionHeader"},
			{ "text": "Regarding the video boards, at this point the White Sox were slightly behind T-Mobile Park in that department. Prior to the 2013 season, the Mariners converted their entire scoreboard real estate in center field into a giant HD video board, where only a portion of it had been video before. Guaranteed Rate had a couple video boards; one straight away center field, and another beyond right field, which served as the out-of-town scoreboard. There were also a couple of old-school dot-matrix scoreboards, which were actually pretty neat! I'm guessing those had been there since the park's opening, but I really liked these for some reason. Maybe the simplicity of them and the slightly 80s feel is what got me. However, these have understandably since been replaced, and I don't think any parks in MLB still have a dot matrix scoreboard of any kind. They shoot off fireworks for each White Sox home run, which is always a neat touch.", "type": "Paragraph"},
			{ "text": "Conclusion", "type": "SectionHeader"},
			{ "text": "The game experience was solid, though less so than Wrigley Field, and also worse than T-Mobile Park, basically by default. While it was the worst stadium (also by default) I'd been to at that point, I absolutely would not rank it the worst anymore, which is probably not a surprise, as I went to the Oakland Coliseum in 2021. While it will likely forever be second place in Chicago, it is still a solid ballpark that I would recommend checking out if you're in town and have time to spare after checking out Wrigley.", "type": "Paragraph"}
		]
	},
	{
		"curName": "Target Field",
		"firstYear": 2010,
		"prevNames": [],
		"springTraining": false,
		"review": [
			{ "text": "Intro", "type": "SectionHeader"},
			{ "text": "Target Field was the 4th park I went to, and it wasn't really near the top of my list to be honest. I didn't think poorly of it, but seeing it on TV for many years, it never really jumped out at me as a place I <i>needed</i> to visit, compared to places like Wrigley Field, and Fenway Park. However, I was extremely surprised and enjoyed my experience here quite a lot.", "type": "Paragraph"},
			{ "text": "Exterior", "type": "SectionHeader"},
			{ "text": "So Target Field is probably the only modern stadium that was actually built with quite significant restraints from the city grid. While plenty of modern stadiums today have returned to the city, the Twins really had to just fit Target Field in right in this spot. They even moved a highway underneath the park! However, they were coming from the Hubert H. Humphrey Metrodome, which was probably one of the worst parks when it was still in use by the Twins. While most park gates are numbered or named off location, like the \"Left Field Gate\" or \"Gate 3\", the Twins named the Target Field gates from their retired numbers, which is a neat way to honor their greats. We entered the gate nearest to right field, which is at street level. The playing field is actually below street level, which is a neat view when coming in. I don't think we walked around much outside the park, but it looks very nice.", "type": "Paragraph"},
			{ "text": "Concourses", "type": "SectionHeader"},
			{ "text": "Being an extremely recent park, there were some notable differences from T-Mobile Park. The concourses were <i>extremely</i> wide, wider than any of the three parks I'd seen before. But I was very impressed so far. I remember there being a small model of the ballpark concept near an escalator we took upward. There was also a neat bar area down the left field line. Since it's pretty enclosed, I was able to take a picture from the upper deck in center field, which yielded a nice panoramic view.", "type": "Paragraph"},
			{ "text": "", "type": "Paragraph"},
			{ "text": "Field", "type": "SectionHeader"},
			{ "text": "The field is fairly standard, but one notable exception is that there is an overhang in right field. If a ball is hit over there, it could be right in line to be caught by the right fielder, before landing in the seats. Off the top of my head, only the Polo Grounds in New York, and Tiger Stadium in Detroit had overhangs in the outfield.", "type": "Paragraph"},
			{ "text": "Game Experience", "type": "SectionHeader"},
			{ "text": "", "type": "Paragraph"},
			{ "text": "Conclusion", "type": "SectionHeader"},
			{ "text": "", "type": "Paragraph"}
		]
	},
	{
		"curName": "Kauffman Stadium",
		"firstYear": 1973,
		"prevNames": [],
		"springTraining": false,
		"review": []
	},
	{
		"curName": "Fenway Park",
		"firstYear": 1912,
		"prevNames": [],
		"springTraining": false,
		"review": []
	},
	{
		"curName": "Yankee Stadium II",
		"firstYear": 2009,
		"prevNames": [],
		"springTraining": false,
		"review": []
	},
	{
		"curName": "Dodger Stadium",
		"firstYear": 1962,
		"prevNames": [],
		"springTraining": false,
		"review": []

	},
	{
		"curName": "Petco Park",
		"firstYear": 2004,
		"prevNames": [],
		"springTraining": false,
		"review": []

	},
	{
		"curName": "Oakland Coliseum",
		"firstYear": 1966,
		"prevNames": [],
		"springTraining": false,
		"review": []

	},
	{
		"curName": "Oracle Park",
		"firstYear": 2000,
		"prevNames": [],
		"springTraining": false,
		"review": []

	},
	{
		"curName": "Angel Stadium",
		"firstYear": 1966,
		"prevNames": [],
		"springTraining": false,
		"review": []

	},
	{
		"curName": "Peoria Stadium",
		"firstYear": 1994,
		"prevNames": [],
		"springTraining": true,
		"review": []
	},
	{
		"curName": "Camelback Ranch",
		"firstYear": 2009,
		"prevNames": [],
		"springTraining": true,
		"review": []
	},
	{
		"curName": "Goodyear Ballpark",
		"firstYear": 2009,
		"prevNames": [],
		"springTraining": true
	},
	{
		"curName": "Surprise Stadium",
		"firstYear": 2002,
		"prevNames": [],
		"springTraining": true,
		"review": []
	},
	{
		"curName": "Minute Maid Park",
		"firstYear": 2000,
		"prevNames": [],
		"springTraining": false,
		"review": []
	},
	{
		"curName": "Globe Life Field",
		"firstYear": 2020,
		"prevNames": [],
		"springTraining": false,
		"review": []
	}
]
