[
	{
		"month": 7,
		"day": 4,
		"year": 2012,
		"homeTeam": "SEA",
		"roadTeam": "BAL",
		"homeTeamRuns": 2,
		"roadTeamRuns": 4,
		"venue": "T-Mobile Park",
		"notes": "This game was the first I'd been to since 2010. Unfortunately I don't know the details of the games I've been to before 2012 so this is when the records start. Hector Noesi went into this game with a 2-10 record and a 5.69 ERA. That trend continued as he gave up 4 runs in 5 innings, which was enough for an opponent facing the 2012 Mariners. They managed to score 2 in the bottom of the 9th, but Miguel Olivo's flyout to right to end the game was just too short. We sat in the right field seats for the first time."
	},
	{
		"month": 8,
		"day": 15,
		"year": 2012,
		"homeTeam": "SEA",
		"roadTeam": "TBA",
		"homeTeamRuns": 1,
		"roadTeamRuns": 0,
		"venue": "T-Mobile Park",
		"notes": "This was a game we went to as a family, and would end up being our last. My sister has a peanut allergy, and this was one of the few games that included a peanut-free section, so that's where we sat. Little did we know we'd end up experiencing history that day. \nThe first out of the game was a running catch made by right fielder Eric Thames, which proved to be incredibly important. After that Felix just mowed guys down like it was nothing. Once it was the 8th inning, the crowd was into it. Everyone was on every pitch. When Felix got the final out, he made that now iconic pose in his celebration.\nThis was the only truly dominant performance I ever saw from Felix in-person, other than Opening Day 2015. I saw him again in the next game I went to, once in 2014, and one more time in 2017, but that was in his decline. While I have other games I enjoyed more, being at a perfect game was incredible."
	},
	{
		"month": 9,
		"day": 1,
		"year": 2012,
		"homeTeam": "SEA",
		"roadTeam": "ANA",
		"homeTeamRuns": 2,
		"roadTeamRuns": 5,
		"venue": "T-Mobile Park",
		"notes": "This was a game we went to as a family, and would end up being our last. My sister has a peanut allergy, and this was one of the few games that included a peanut-free section, so that's where we sat. Little did we know we'd end up experiencing history that day. \nThe first out of the game was a running catch made by right fielder Eric Thames, which proved to be incredibly important. After that Felix just mowed guys down like it was nothing. Once it was the 8th inning, the crowd was into it. Everyone was on every pitch. When Felix got the final out, he made that now iconic pose in his celebration.\nThis was the only truly dominant performance I ever saw from Felix in-person, other than Opening Day 2015. I saw him again in the next game I went to, once in 2014, and one more time in 2017, but that was in his decline. While I have other games I enjoyed more, being at a perfect game was incredible."
	},
	{
		"month": 6,
		"day": 29,
		"year": 2013,
		"homeTeam": "SEA",
		"roadTeam": "CHN",
		"homeTeamRuns": 3,
		"roadTeamRuns": 5,
		"venue": "T-Mobile Park",
		"notes": "This was a Turn back the Clock Night to 1906. The Mariners wore uniforms from the 1906 Seattle Turks team, while the Cubs wore their 1906 uniforms. This was my first Interleague game, which was neat. While the Mariners tied the game in the bottom of the 9th inning, that was all they could muster as the Cubs came out on top from a go-ahead home run in the 11th inning by Alfonso Soriano, who would eventually be traded to the Yankees at the deadline. My dad and I sat in the upper deck from behind home plate for the first time, which is a spot I've repeatedly gone back to when I don't want to spend a lot on tickets but want a good view."
	},
	{
		"month": 8,
		"day": 10,
		"year": 2013,
		"homeTeam": "SEA",
		"roadTeam": "MIL",
		"homeTeamRuns": 0,
		"roadTeamRuns": 10,
		"venue": "T-Mobile Park",
		"notes": "This game was supposed to be exciting, since they had a pregame ceremony celebrating Ken Griffey Jr.'s induction into the Mariners Hall of Fame. Unfortunately, they just failed to show up in any capacity. Hisashi Iwakuma had a great outing, up until the 7th where he just lost it, and Mariners manager Eric Wedge left him in for probably too long. This is tied for the most lopsided loss I've seen in person, with a game I saw in 2018 against the Dodgers."
	},
	{
		"month": 4,
		"day": 8,
		"year": 2014,
		"homeTeam": "SEA",
		"roadTeam": "ANA",
		"homeTeamRuns": 5,
		"roadTeamRuns": 3,
		"venue": "T-Mobile Park",
		"notes": "This was the first home opener I was able to attend. We left right after school ended, and we ended up being late and missed the pregame ceremonies! The Mariners hit a little bit, including Corey Hart, who hit 2 home runs. This would not be indicative of his success, however, as he only ended up with 6 home runs in the 68 games he played that year. It was actually a decent idea to sign him, it just didn't work out at all. \nJames Paxton pitched a good game, though left in the 6th inning with an injury. Little did we know this would be the start of his yearly injury problems that he has never overcome to this day. Overall a fun game, and the beginning of my currently unbroken (only by 2020) streak of home openers."
	}
]
